import 'package:questionapp_project/models/question.dart';

List<Question> questions = [
  Question(
    "ในสมัยราชวงศ์หยวน นักเดินเรือคนใดได้มาเข้าเฝ้ากุบไล ข่าน",
    {
      "เฟอร์ดินาน แมกเจลลัน": false,
      "เจมส์ คุก": false,
      "คริสโตเฟอร์ โคลัมบัส": false,
      "มาร์โค โปโล": true,
    },
  ),
  Question("ทวีปเอเชียมีทั้งหมดกี่ภูมิภาค", {
    "4 ภูมิภาค": false,
    "6 ภูมิภาค": false,
    "3 ภูมิภาค": false,
    "5 ภูมิภาค": true,
  }),
  Question("อารยธรรมใดในเอเชียที่อยู่ระหว่างลุ่มแม่น้ำ ไทกริส - ยูเฟรติส", {
    "อารยธรรมเมโสโปเตเมีย": true,
    "อารยธรรมจีน": false,
    "อารยธรรมอิสลาม": false,
    "ถูกทุกข้อ": false,
  }),
  Question("แม่น้ำฮวงโห หรือ หวางเหอ ของอารยธรรมจีน มีชื่อเรียกอื่นว่าอะไร", {
    "แม่น้ำขาว": false,
    "แม่น้ำแยงซีเกียง": false,
    "แม่น้ำวิปโยค": true,
    "แม่น้ำเจ้าพระยา": false,
  }),
  Question("ประเทศในข้อใดไม่อยู่ในเอเชียใต้", {
    "ศรีลังกา": false,
    "อินเดีย": false,
    "อิรัก": true,
    "ทุกข้อ": false,
  }),
  Question("ประเทศใดต่อไปนี้ในเอเชียปกครองด้วยระบอบคอมมิวนิสต์", {
    "ปากีสถาน": false,
    "อิหร่าน": false,
    "ลาว": true,
    "มาเลเซีย": false,
  }),
  Question(
      "ราชวงศ์ใดเป็นราชวงศ์แรกของอารยธรรมอินเดีย", {
    "ราชวงศ์หมิง": false,
    "ราชวงศ์มัมลูก": false,
    "ราชวงศ์คุปตะ": false,
    "ราชวงศ์เมาริยะ": true,
  }),
  Question("ประเทศใดต่อไปนี้ไม่อยู่ในเอเชียตะวันออก", {
    "คาซัคสถาน": true,
    "จีน": false,
    "มองโกเลีย": false,
    "ทุกข้อ": false,
  }),
  Question(
      "ประเทศในข้อใดไม่ติดกับทะเล",
      {
        "มาเลเซีย": false,
        "เนปาล": true,
        "เวียดนาม": false,
        "ไทย": false,
      }),
  Question(
      "อารยธรรมแห่งแรกในเอเชียใต้ถือกำเนิดในบริเวณลุ่มแม่น้ำใดเป็นแห่งแรก", {
    "แม่น้ำโขง": false,
    "แม่น้ำสินธุ": true,
    "แม่น้ำน่าน": false,
    "แม่น้ำคงคา": false,
  }),
  Question(
      "กระแสน้ำอุ่นในข้อใดเป็นแหล่งปลาชุมในประเทศญี่ปุ่น", {
    "โอยาชิบะ": false,
    "โอยาชิโว": false,
    "กุโรชิโว": true,
    "ไซบีเรีย": false,
  }),
  Question(
      "สิ่งประดิษฐ์ใดอยู่ใน 1 ใน 4 สิ่งประดิษฐ์ของอารยธรรมจีน", {
    "กล้องส่องทางไกล": false,
    "จักรยาน": false,
    "ดินปืน": true,
    "นาฬิกา": false,
  }),
  Question(
      "ประเทศใดต่อไปนี้ที่แยกตัวออกมาจากอินเดีย", {
    "เนปาล": false,
    "บังกลาเทศ": true,
    "จีน": false,
    "ภูฏาน": false,
  }),
  Question(
      "ในอดีตประเทศต่างๆในเอเชียส่วนใหญ่ต่างเคยเป็นอดีตรัฐของ...", {
    "สหรัฐอเมริกา": false,
    "จีน": false,
    "สหภาพโซเวียต": true,
    "ไทย": false,
  }),
  Question(
      "ผู้วางรากฐานให้ด้านวัฒนธรรมให้กับเอเชียตะวันออกเฉียงใต้คือชนชาติใด", {
    "จีน": true,
    "อาหรับ": false,
    "อิเดีย": false,
    "มอญ": false,
  }),
];